# 다음 퀴즈를 수행하시오.

### Q1. pandas 모듈을 pd로, numpy 모듈을 np로 불러오시오.

In [1]:
import pandas as pd
import numpy as np

### Q2. "class_scores.csv"를 pandas 모듈을 활용하여 불러오고 객체 종류를 확인하시오
(단, df 객체에 저장하시오)

In [4]:
df = pd.read_csv("DS_lv1/class_scores.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Stu_ID     600 non-null    int64
 1   grade      600 non-null    int64
 2   class      600 non-null    object
 3   gender     600 non-null    object
 4   Math       600 non-null    int64
 5   English    600 non-null    int64
 6   Science    600 non-null    int64
 7   Marketing  600 non-null    int64
 8   Writing    600 non-null    int64
dtypes: int64(7), object(2)
memory usage: 42.3+ KB

### Q3. df의 첫 3개 row를 출력하시오

In [3]:
df.head(3)

   Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
0   10101      1     A      M    55       84       50         40       59
1   10102      1     A      M    29       94       41         87       57
2   10103      1     A      F    28       80       68         41      100

### Q4. df의 마지막 2개 row를 출력하시오

In [5]:
df.tail(2)

     Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
598   30539      3     E      M    51       67       39         91       55
599   30540      3     E      M    76       29       80         91       66

### Q5. df의 차원을 확인하시오

In [7]:
df.shape

(600, 9)

### Q6. df의 row 개수를 확인하시오

In [10]:
len(df)

600

### Q7. df의 column 개수를 확인하시오

In [16]:
len(df.columns)

9

### Q8. df의 column 이름을 확인하시오

In [18]:
df.columns

Index(['Stu_ID', 'grade', 'class', 'gender', 'Math', 'English', 'Science',
       'Marketing', 'Writing'],
      dtype='object')

### Q9. 2학년의 학번, 학년, 성적 전체를 추출하여 df_sub 객체에 저장하시오.

In [30]:
df_sub = df.loc[df["grade"] == 2, ]
df_sub = df_sub.drop(["gender", "class"], axis=1)
df_sub
# df_sub = df.loc[df["grade"] == 2, columns]  :columns는 열 이름

     Stu_ID  grade  Math  English  Science  Marketing  Writing
200   20101      2    57       68       98         88       40
201   20102      2    94       33       32         44       90
202   20103      2    75       73       34         37       85
203   20104      2    73       85       35         39       65
204   20105      2    64       26       86         64       72
..      ...    ...   ...      ...      ...        ...      ...
395   20536      2    29       33       95         40       51
396   20537      2    95      100       96         95       60
397   20538      2    79       55       32         78       31
398   20539      2    74       60       99         68       80
399   20540      2    58       88       35         92       41

[200 rows x 7 columns]

### Q10. df_sub를 기준으로 학생 개개인의 성적 평균을 계산하고 학번과 같이 "score_avg.csv"로 저장하시오.

In [63]:
df_avg = pd.DataFrame({"Stu_ID" : df_sub["Stu_ID"],
                      "avg" : (df_sub["Math"] + df_sub["Writing"] + df_sub["English"] + df_sub["Science"] + df_sub["Marketing"])/5})
df_avg.to_csv("score_avg.csv")
df_avg

     Stu_ID   avg
200   20101  70.2
201   20102  58.6
202   20103  60.8
203   20104  59.4
204   20105  62.4
..      ...   ...
395   20536  49.6
396   20537  89.2
397   20538  55.0
398   20539  76.2
399   20540  62.8

[200 rows x 2 columns]

In [53]:
df_score_avg = pd.DataFrame({"Stu_Id" : df_sub["Stu_ID"],
              "Score_mean" : df_sub.iloc[:, 2:].mean(axis = 1)})
df_score_avg.head(2)

     Stu_Id  Score_mean
200   20101        70.2
201   20102        58.6

### Q11. df_sub를 기준으로 과목별 성적 최고점, 최저점, 표준편차를 계산하고 과목명과 함께 score_stat에 저장하시오.

In [68]:
score_stat = pd.DataFrame({"name" : df_sub.columns[2:],
            "Score_max" : df_sub.iloc[:, 2:].max(),
            "Score_min" : df_sub.iloc[:, 2:].min(),
            "Score_std" : df_sub.iloc[:, 2:].std()})
score_stat

                name  Score_max  Score_min  Score_std
Math            Math        100         25  21.966154
English      English        100         25  20.638307
Science      Science        100         25  23.344244
Marketing  Marketing        100         25  22.021939
Writing      Writing        100         25  21.772637

### Q12. score_stat의 index를 0 ~ 4로 만드시오.

In [69]:
score_stat = score_stat.reset_index()
score_stat

       index       name  Score_max  Score_min  Score_std
0       Math       Math        100         25  21.966154
1    English    English        100         25  20.638307
2    Science    Science        100         25  23.344244
3  Marketing  Marketing        100         25  22.021939
4    Writing    Writing        100         25  21.772637

### Q13. score_stat 객체를 "score_stat.csv"로 저장하시오.

In [70]:
score_stat.to_csv("score_stat.csv")